   --alter database MINIMAKS_SQL set Single_user   with rollback 
    -- use MINIMAKS_SQL
   
   
declare @ReportDate as nvarchar(10), @MnOne as nvarchar(10), @MnTwo as nvarchar(10)
set @ReportDate='2021-06-01'

set @MnOne = CONVERT(nvarchar(10), dateadd(month, -2, convert(date, @ReportDate))) 
set @MnTwo = CONVERT(nvarchar(10), dateadd(month, -1, convert(date, @ReportDate))) 
print @ReportDate + '; ' + @MnOne + '; ' + @MnTwo + '; ' + convert(nvarchar(10), dateadd(dd, -1, dateadd(month, 1, convert(date, @ReportDate))))


/*
delete from minimaks_sql.dbo.ОтчетОборачиваемостьНов_всп 
where [Дата отчета]=convert(date, @ReportDate)

*/
declare @qwr as nvarchar(max), @qwr1 as nvarchar(max), @qwr2 as nvarchar(max)
declare @qwr3 as nvarchar(max), @qwr4 as nvarchar(max), @qwr5 as nvarchar(max)
declare @qwr6 as nvarchar(max), @qwr7 as nvarchar(max), @qwr8 as nvarchar(max)
declare @dtWhF as nvarchar(255), @dtWhL as nvarchar(255)
declare @SalesPeriodT as NVarChar(255), @SalesPeriodO as NVarChar(255)
--declare @ReportDate as NVarChar(15)


set @dtWhF='[Dim_Календарь].[Дата].&[' + @MnOne + 'T00:00:00]' --начальная дата остатков
set @dtWhL='[Dim_Календарь].[Дата].&[' + convert(nvarchar(10), dateadd(dd, -1, dateadd(month, 1, convert(date, @ReportDate)))) + 'T00:00:00]' --конечная дата остатков
-- период продаж 3 месяца
set @SalesPeriodT='[Dim_Календарь].[Месяц].&['+ @MnOne +'T00:00:00], [Dim_Календарь].[Месяц].&['+ @MnTwo +'T00:00:00], [Dim_Календарь].[Месяц].&[' + @ReportDate + 'T00:00:00]'
-- последний период продаж
set @SalesPeriodO='[Dim_Календарь].[Месяц].&[' + @ReportDate +'T00:00:00]'
--set @ReportDate = '2021-02-01'

print @dtWhF
print @dtWhL
print @SalesPeriodT
print @SalesPeriodO





set @qwr = 'insert into minimaks_sql.dbo.ОтчетОборачиваемостьНов_всп ([Дата отчета],[ТипСклада],[Округ],[ТипПодразделения],[ЛогПодразделение],[Артикул],[ОстатокНач_Количество],[ОстатокНач_СтоимостьСНДС],[ОстаткиКон_Количество],[ОстаткиКон_СтоимостьСНДС],[Продажи1Мес_Количество],[Продажи1Мес_Себестоимость],[Продажи1Мес_Стоимость],[Продажи3Мес_Количество],[Продажи3Мес_Себестоимость],[Продажи3Мес_Стоимость],[Отгрузки1Мес_Количество],[Отгрузки1Мес_Себестоимость],[Отгрузки1Мес_Стоимость],[Отгрузки3Мес_Количество],[Отгрузки3Мес_Себестоимость],[Отгрузки3Мес_Стоимость]) ' + 
'select ''' + @ReportDate + ''' as [Дата отчета], ' +
'ТипСклада, ' + 
'Округ, ' + 
'ТипПодразделения, ' + 
'ЛогПодразделение, ' + 
'Артикул, ' + 
'SUM(ОстатокНач_Количество) as ОстатокНач_Количество, ' + 
'SUM(ОстатокНач_СтоимостьСНДС) as ОстатокНач_СтоимостьСНДС, ' + 
'sum(ОстаткиКон_Количество) as ОстаткиКон_Количество, ' + 
'sum(ОстаткиКон_СтоимостьСНДС) as ОстаткиКон_СтоимостьСНДС, ' + 
'sum(Продажи1Мес_Количество) as Продажи1Мес_Количество, ' + 
'sum(Продажи1Мес_Себестоимость) as Продажи1Мес_Себестоимость, ' + 
'sum(Продажи1Мес_Стоимость) as Продажи1Мес_Стоимость, ' + 
'sum(Продажи3Мес_Количество) as Продажи3Мес_Количество, ' + 
'sum(Продажи3Мес_Себестоимость) as Продажи3Мес_Себестоимость, ' + 
'sum(Продажи3Мес_Стоимость) as Продажи3Мес_Стоимость, ' + 
'sum(Отгрузки1Мес_Количество) as Отгрузки1Мес_Количество, ' + 
'sum(Отгрузки1Мес_Себестоимость) as Отгрузки1Мес_Себестоимость, ' + 
'sum(Отгрузки1Мес_Стоимость) as Отгрузки1Мес_Стоимость, ' + 
'sum(Отгрузки3Мес_Количество) as Отгрузки3Мес_Количество, ' + 
'sum(Отгрузки3Мес_Себестоимость) as Отгрузки3Мес_Себестоимость, ' + 
'sum(Отгрузки3Мес_Стоимость) as Отгрузки3Мес_Стоимость ' + 

--'into minimaks_sql.dbo.ОтчетОборачиваемостьНов_всп ' + 

'from ' + 
'( ' + 
'select ' + 
'''Основной'' as ТипСклада, ' + 
'cast([[Dim_Предприятие]].[Предприятие_Округ_Наименование]].[Предприятие_Округ_Наименование]].[MEMBER_CAPTION]]] as nvarchar(100)) as Округ, ' + 
'cast([[Dim_Предприятие]].[Предприятие_Подразделение_Тип]].[Предприятие_Подразделение_Тип]].[MEMBER_CAPTION]]] as nvarchar(20)) as ТипПодразделения, ' + 
'cast([[Dim_Предприятие]].[Предприятие_Подразделение_Наименование]].[Предприятие_Подразделение_Наименование]].[MEMBER_CAPTION]]] as nvarchar(100)) as ЛогПодразделение, ' + 
'CAST([[Dim_Номенклатура]].[Номенклатура_Артикул]].[Номенклатура_Артикул]].[MEMBER_CAPTION]]] as nvarchar(20)) as Артикул, ' + 
'CONVERT(/*numeric(12,2)*/float, cast([[Measures]].[Остатки_Количество_Ежедневные]]] as nvarchar)) as ОстатокНач_Количество, ' + 
'CONVERT(/*numeric(12,2)*/float, cast([[Measures]].[Остатки_Стоимость_Ежедневные_с_НДС]]] as nvarchar)) as ОстатокНач_СтоимостьСНДС, ' + 
'0 as Продажи3Мес_Количество, ' + 
'0 as Продажи3Мес_Себестоимость, ' + 
'0 as Продажи3Мес_Стоимость, ' + 
'0 as Отгрузки3Мес_Количество, ' + 
'0 as Отгрузки3Мес_Себестоимость, ' + 
'0 as Отгрузки3Мес_Стоимость, ' + 
'0 as Продажи1Мес_Количество, ' + 
'0 as Продажи1Мес_Себестоимость, ' + 
'0 as Продажи1Мес_Стоимость, ' + 
'0 as Отгрузки1Мес_Количество, ' + 
'0 as Отгрузки1Мес_Себестоимость, ' + 
'0 as Отгрузки1Мес_Стоимость, ' + 
'0 as ОстаткиКон_Количество, ' + 
'0 as ОстаткиКон_СтоимостьСНДС '  


set @qwr1 = 'from openquery(SSAS_DATA_ANALYSIS, '' SELECT NON EMPTY { [Measures].[Остатки_Количество_Ежедневные], ' + 
'[Measures].[Остатки_Стоимость_Ежедневные_с_НДС] } ON COLUMNS ' + 
', NON EMPTY { (' + @dtWhF + ', ' + 
'[Dim_Предприятие].[Предприятие_Округ_Наименование].[Предприятие_Округ_Наименование].ALLMEMBERS * ' + 
'[Dim_Предприятие].[Предприятие_Подразделение_Тип].[Предприятие_Подразделение_Тип].ALLMEMBERS * ' + 
'[Dim_Предприятие].[Предприятие_Подразделение_Наименование].[Предприятие_Подразделение_Наименование].ALLMEMBERS * ' + 
'[Dim_Номенклатура].[Номенклатура_Артикул].[Номенклатура_Артикул].ALLMEMBERS * ' + 
'[Dim_Номенклатура].[Номенклатура_Наименование].[Номенклатура_Наименование].ALLMEMBERS ) } ' + 
'having ( [Measures].[Остатки_Количество_Ежедневные]>0 and [Measures].[Остатки_Стоимость_Ежедневные_с_НДС]>=0) ON ROWS ' + 
'FROM ( SELECT ( { [Dim_Предприятие].[Предприятие_Подразделение_Признак_Логистическое].&[Да] } ) ON COLUMNS ' + 
'FROM ( SELECT ( { { [Dim_Предприятие].[Предприятие_Склад_Тип].&[101. Рабочие остатки], [Dim_Предприятие].[Предприятие_Склад_Тип].&[106. Дисконт] } } ) ON COLUMNS ' + 
'FROM ( SELECT ( { ' + @dtWhF + ' } ) ON COLUMNS ' + 
'FROM [DATA_ANALYSIS]))) ' + 
'WHERE ( [Dim_Предприятие].[Предприятие_Склад_Тип].CurrentMember, [Dim_Предприятие].[Предприятие_Подразделение_Признак_Логистическое].&[Да] ) '') ' 

set @qwr2 = 'union ' + 

'select ' + 
'''Дополнительные'' as ТипСклада, ' + 
'cast([[Dim_Предприятие]].[Предприятие_Округ_Наименование]].[Предприятие_Округ_Наименование]].[MEMBER_CAPTION]]] as nvarchar(100)) as Округ, ' + 
'cast([[Dim_Предприятие]].[Предприятие_Подразделение_Тип]].[Предприятие_Подразделение_Тип]].[MEMBER_CAPTION]]] as nvarchar(20)) as ТипПодразделения, ' + 
'cast([[Dim_Предприятие]].[Предприятие_Подразделение_Наименование]].[Предприятие_Подразделение_Наименование]].[MEMBER_CAPTION]]] as nvarchar(100)) as ЛогПодразделение, ' + 
'CAST([[Dim_Номенклатура]].[Номенклатура_Артикул]].[Номенклатура_Артикул]].[MEMBER_CAPTION]]] as nvarchar(20)) as Артикул, ' + 
'CONVERT(/*numeric(12,2)*/float, cast([[Measures]].[Остатки_Количество_Ежедневные]]] as nvarchar)) as ОстатокНач_Количество, ' + 
'CONVERT(/*numeric(12,2)*/float, cast([[Measures]].[Остатки_Стоимость_Ежедневные_с_НДС]]] as nvarchar)) as ОстатокНач_СтоимостьСНДС, ' + 
'0 as Продажи3Мес_Количество, ' + 
'0 as Продажи3Мес_Себестоимость, ' + 
'0 as Продажи3Мес_Стоимость, ' + 
'0 as Отгрузки3Мес_Количество, ' + 
'0 as Отгрузки3Мес_Себестоимость, ' + 
'0 as Отгрузки3Мес_Стоимость, ' + 
'0 as Продажи1Мес_Количество, ' + 
'0 as Продажи1Мес_Себестоимость, ' + 
'0 as Продажи1Мес_Стоимость, ' + 
'0 as Отгрузки1Мес_Количество, ' + 
'0 as Отгрузки1Мес_Себестоимость, ' + 
'0 as Отгрузки1Мес_Стоимость, ' + 
'0 as ОстаткиКон_Количество, ' + 
'0 as ОстаткиКон_СтоимостьСНДС ' + 

'from openquery(SSAS_DATA_ANALYSIS, '' SELECT NON EMPTY { [Measures].[Остатки_Количество_Ежедневные], ' + 
'[Measures].[Остатки_Стоимость_Ежедневные_с_НДС] } ON COLUMNS ' + 
', NON EMPTY { (' + @dtWhF + ', ' + 
'[Dim_Предприятие].[Предприятие_Округ_Наименование].[Предприятие_Округ_Наименование].ALLMEMBERS * ' + 
'[Dim_Предприятие].[Предприятие_Подразделение_Тип].[Предприятие_Подразделение_Тип].ALLMEMBERS * ' + 
'[Dim_Предприятие].[Предприятие_Подразделение_Наименование].[Предприятие_Подразделение_Наименование].ALLMEMBERS * ' + 
'[Dim_Номенклатура].[Номенклатура_Артикул].[Номенклатура_Артикул].ALLMEMBERS * ' + 
'[Dim_Номенклатура].[Номенклатура_Наименование].[Номенклатура_Наименование].ALLMEMBERS ) } ' + 
'having ( [Measures].[Остатки_Количество_Ежедневные]>0 and [Measures].[Остатки_Стоимость_Ежедневные_с_НДС]>=0) ON ROWS ' + 
'FROM ( SELECT ( { [Dim_Предприятие].[Предприятие_Подразделение_Признак_Логистическое].&[Да] } ) ON COLUMNS ' + 
'FROM ( SELECT ( { { [Dim_Предприятие].[Предприятие_Склад_Тип].&[102. Витрина], [Dim_Предприятие].[Предприятие_Склад_Тип].&[103. Брак], [Dim_Предприятие].[Предприятие_Склад_Тип].&[104. Уценка], [Dim_Предприятие].[Предприятие_Склад_Тип].&[109. Производство] } } ) ON COLUMNS ' + 
'FROM ( SELECT ( { ' + @dtWhF + ' } ) ON COLUMNS ' + 
'FROM [DATA_ANALYSIS]))) ' + 
'WHERE ( [Dim_Предприятие].[Предприятие_Склад_Тип].CurrentMember, [Dim_Предприятие].[Предприятие_Подразделение_Признак_Логистическое].&[Да] ) '') ' 

set @qwr3= 'union ' + 

'select ' + 
'''Основной'' as ТипСклада, ' + 
'cast([[Dim_Предприятие]].[Предприятие_Округ_Наименование]].[Предприятие_Округ_Наименование]].[MEMBER_CAPTION]]] as nvarchar(100)) as Округ, ' + 
'cast([[Dim_Предприятие]].[Предприятие_Подразделение_Тип]].[Предприятие_Подразделение_Тип]].[MEMBER_CAPTION]]] as nvarchar(20)) as ТипПодразделения, ' + 
'cast([[Dim_Предприятие]].[Предприятие_Подразделение_Наименование]].[Предприятие_Подразделение_Наименование]].[MEMBER_CAPTION]]] as nvarchar(100)) as ЛогПодразделение, ' + 
'CAST([[Dim_Номенклатура]].[Номенклатура_Артикул]].[Номенклатура_Артикул]].[MEMBER_CAPTION]]] as nvarchar(20)) as Артикул, ' + 
'0 as ОстатокНач_Количество, ' + 
'0 as ОстатокНач_СтоимостьСНДС, ' + 
'CONVERT(/*numeric(12,2)*/float, cast([[Measures]].[Продажи_Количество]]] as nvarchar)) as Продажи3Мес_Количество, ' + 
'CONVERT(/*numeric(12,2)*/float, cast([[Measures]].[Продажи_Себестоимость_с_НДС]]] as nvarchar)) as Продажи3Мес_Себестоимость, ' + 
'CONVERT(/*numeric(12,2)*/float, cast([[Measures]].[Продажи_Стоимость]]] as nvarchar)) as Продажи3Мес_Стоимость, ' + 
'0 as Отгрузки3Мес_Количество, ' + 
'0 as Отгрузки3Мес_Себестоимость, ' + 
'0 as Отгрузки3Мес_Стоимость, ' + 
'CONVERT(/*numeric(12,2)*/float, cast([[Measures]].[ПродажиПоследнМесяц_Количество]]] as nvarchar)) as Продажи1Мес_Количество, ' + 
'CONVERT(/*numeric(12,2)*/float, cast([[Measures]].[ПродажиПоследнМесяц_СебеСтоимость]]] as nvarchar)) as Продажи1Мес_Себестоимость, ' + 
'CONVERT(/*numeric(12,2)*/float, cast([[Measures]].[ПродажиПоследнМесяц_Стоимость]]] as nvarchar)) as Продажи1Мес_Стоимость, ' + 
'0 as Отгрузки1Мес_Количество, ' + 
'0 as Отгрузки1Мес_Себестоимость, ' + 
'0 as Отгрузки1Мес_Стоимость, ' + 
'0 as ОстаткиКон_Количество, ' + 
'0 as ОстаткиКон_СтоимостьСНДС ' + 

'from openquery(SSAS_DATA_ANALYSIS, ''with ' +
												 'member measures.[ПродажиПоследнМесяц_Количество] as sum(' + @SalesPeriodO + ', [Measures].[Продажи_Количество])' +
												 'member measures.[ПродажиПоследнМесяц_Стоимость] as sum(' + @SalesPeriodO + ', [Measures].[Продажи_Стоимость]) ' +
												 'member measures.[ПродажиПоследнМесяц_СебеСтоимость] as sum(' + @SalesPeriodO + ', [Measures].[Продажи_Стоимость_в_Базовых_ММ_Ценах]) ' +

											 'SELECT ' +
													'NON EMPTY { '+
																'[Measures].[Продажи_Количество], ' +
																'[Measures].[Продажи_Себестоимость_с_НДС], ' +
																'[Measures].[Продажи_Стоимость] ' +
																', ' +
																'measures.[ПродажиПоследнМесяц_Количество], ' +
																'measures.[ПродажиПоследнМесяц_Стоимость], ' +
																'measures.[ПродажиПоследнМесяц_СебеСтоимость] ' +
																'} ON COLUMNS ' +
												  ', NON EMPTY { ([Dim_Предприятие].[Предприятие_Округ_Наименование].[Предприятие_Округ_Наименование].ALLMEMBERS * ' +
																 '[Dim_Предприятие].[Предприятие_Подразделение_Тип].[Предприятие_Подразделение_Тип].ALLMEMBERS * ' +
																 '[Dim_Предприятие].[Предприятие_Подразделение_Наименование].[Предприятие_Подразделение_Наименование].ALLMEMBERS * ' +
																 '[Dim_Номенклатура].[Номенклатура_Артикул].[Номенклатура_Артикул].ALLMEMBERS * ' + 
																 '[Dim_Номенклатура].[Номенклатура_Наименование].[Номенклатура_Наименование].ALLMEMBERS ) ' +
																 '}  ON ROWS ' 
set @qwr4= 											'FROM ( '+
											    --    'SELECT ( { [Dim_Контрагенты].[Контрагенты_Признак_Обособленные].&[Нет], ' + 
												--			  '[Dim_Контрагенты].[Контрагенты_Признак_Обособленные].[All].UNKNOWNMEMBER } ) ON COLUMNS ' + 
												--   'FROM (' 
												   'SELECT ( { [Dim_Документы].[Документы_Признак_Реализация_Поставщику_Возврат].&[Нет] } ) ON COLUMNS '  + 
														  'FROM ( SELECT ( { [Dim_Документы].[Документы_Тип].&[ОтчетОРозничныхПродажах], ' + 
																			'[Dim_Документы].[Документы_Тип].&[РеализацияТоваровУслуг], ' + 
																			'[Dim_Документы].[Документы_Тип].&[ЧекККМ] } ) ON COLUMNS ' +
																' FROM ( SELECT ( { [Dim_Предприятие].[Предприятие_Подразделение_Признак_Логистическое].&[Да] } ) ON COLUMNS ' +
																		'FROM ( SELECT ( { ' + @SalesPeriodT + ' } ) ON COLUMNS ' +
																			   'FROM [DATA_ANALYSIS])))) ' + --')'
											'WHERE ( [Dim_Календарь].[Месяц].CurrentMember, ' +
													'[Dim_Предприятие].[Предприятие_Подразделение_Признак_Логистическое].&[Да], ' +
													'[Dim_Документы].[Документы_Тип].CurrentMember, ' +
													'[Dim_Документы].[Документы_Признак_Реализация_Поставщику_Возврат].&[Нет], ' + 
													--'[Dim_Контрагенты].[Контрагенты_Признак_Обособленные].CurrentMember, ' + 
													'{([Dim_Контрагенты].[Контрагенты_ИНН].[Контрагенты_ИНН].members, { [Dim_Контрагенты].[Контрагенты_Признак_Обособленные].&[Нет], [Dim_Контрагенты].[Контрагенты_Признак_Обособленные].[All].UNKNOWNMEMBER }), ' + -- добавлено 05/10/20
													'({[Dim_Контрагенты].[Контрагенты_ИНН].&[7814605174], [Dim_Контрагенты].[Контрагенты_ИНН].&[7804339445]}, [Dim_Контрагенты].[Контрагенты_Признак_Обособленные].&[Да])}' + -- добавлено 05/10/20
													') '')  '    

set @qwr5= 'union ' +

'select ' + 
      '''Основной''  as ТипСклада, ' +
'cast([[Dim_Предприятие]].[Предприятие_Округ_Наименование]].[Предприятие_Округ_Наименование]].[MEMBER_CAPTION]]] as nvarchar(100)) as Округ, ' + 
'cast([[Dim_Предприятие]].[Предприятие_Подразделение_Тип]].[Предприятие_Подразделение_Тип]].[MEMBER_CAPTION]]] as nvarchar(20)) as ТипПодразделения, ' + 
'cast([[Dim_Предприятие]].[Предприятие_Подразделение_Наименование]].[Предприятие_Подразделение_Наименование]].[MEMBER_CAPTION]]] as nvarchar(100)) as ЛогПодразделение, ' + 
'CAST([[Dim_Номенклатура]].[Номенклатура_Артикул]].[Номенклатура_Артикул]].[MEMBER_CAPTION]]] as nvarchar(20)) as Артикул, ' + 
'0 as ОстатокНач_Количество, ' + 
'0 as ОстатокНач_СтоимостьСНДС, ' + 
'0 as Продажи3Мес_Количество, ' + 
'0 as Продажи3Мес_Себестоимость, ' + 
'0 as Продажи3Мес_Стоимость, ' + 
'CONVERT(/*numeric(12,2)*/float, cast([[Measures]].[Продажи_Количество]]] as nvarchar)) as Отгрузки3Мес_Количество, ' + 
'CONVERT(/*numeric(12,2)*/float, cast([[Measures]].[Продажи_Себестоимость_с_НДС]]] as nvarchar)) as Отгрузки3Мес_Себестоимость, ' + 
'CONVERT(/*numeric(12,2)*/float, cast([[Measures]].[Продажи_Стоимость]]] as nvarchar)) as Отгрузки3Мес_Стоимость, ' + 
'0 as Продажи1Мес_Количество, ' + 
'0 as Продажи1Мес_Себестоимость, ' + 
'0 as Продажи1Мес_Стоимость, ' + 
'CONVERT(/*numeric(12,2)*/float, cast([[Measures]].[ПродажиПоследнМесяц_Количество]]] as nvarchar)) as Отгрузки1Мес_Количество, ' + 
'CONVERT(/*numeric(12,2)*/float, cast([[Measures]].[ПродажиПоследнМесяц_СебеСтоимость]]] as nvarchar)) as Отгрузки1Мес_Себестоимость, ' + 
'CONVERT(/*numeric(12,2)*/float, cast([[Measures]].[ПродажиПоследнМесяц_Стоимость]]] as nvarchar)) as Отгрузки1Мес_Стоимость, ' + 
'0 as ОстаткиКон_Количество, ' + 
'0 as ОстаткиКон_СтоимостьСНДС ' + 

'from openquery(SSAS_DATA_ANALYSIS, ''with ' + 
												'member measures.[ПродажиПоследнМесяц_Количество] as sum(' + @SalesPeriodO + ', [Measures].[Продажи_Количество]) ' +
												'member measures.[ПродажиПоследнМесяц_Стоимость] as sum(' + @SalesPeriodO + ', [Measures].[Продажи_Стоимость]) ' +
												'member measures.[ПродажиПоследнМесяц_СебеСтоимость] as sum(' + @SalesPeriodO + ', [Measures].[Продажи_Стоимость_в_Базовых_ММ_Ценах]) ' +

											 'SELECT ' +
													'NON EMPTY {' +
																'[Measures].[Продажи_Количество], ' +
																'[Measures].[Продажи_Себестоимость_с_НДС], ' +
																'[Measures].[Продажи_Стоимость]' +
																', '+
																'measures.[ПродажиПоследнМесяц_Количество], '+
																'measures.[ПродажиПоследнМесяц_Стоимость], '+
																'measures.[ПродажиПоследнМесяц_СебеСтоимость] ' +
																'} ON COLUMNS '+
												  ', NON EMPTY { ([Dim_Предприятие].[Предприятие_Округ_Наименование].[Предприятие_Округ_Наименование].ALLMEMBERS * '+
																 '[Dim_Предприятие].[Предприятие_Подразделение_Тип].[Предприятие_Подразделение_Тип].ALLMEMBERS * '+
																 '[Dim_Предприятие].[Предприятие_Подразделение_Наименование].[Предприятие_Подразделение_Наименование].ALLMEMBERS * '+
																 '[Dim_Номенклатура].[Номенклатура_Артикул].[Номенклатура_Артикул].ALLMEMBERS * '+
																 '[Dim_Номенклатура].[Номенклатура_Наименование].[Номенклатура_Наименование].ALLMEMBERS ) '+
																 '}  ON ROWS '+
											'FROM (  SELECT ( { [Dim_Документы].[Документы_Признак_Реализация_Поставщику_Возврат].&[Нет] } ) ON COLUMNS '+
														  'FROM ( SELECT ( { [Dim_Документы].[Документы_Тип].&[ОтчетОРозничныхПродажах], '+
														                    '[Dim_Документы].[Документы_Тип].&[РеализацияТоваровУслуг], '+
														                    '[Dim_Документы].[Документы_Тип].&[ЧекККМ], '+
														                    '[Dim_Документы].[Документы_Тип].&[ПеремещениеТоваров]  } ) ON COLUMNS '+
																 'FROM ( SELECT ( { [Dim_Предприятие].[Предприятие_Подразделение_Признак_Логистическое].&[Да] } ) ON COLUMNS '+
																		'FROM ( SELECT ( { ' + @SalesPeriodT + ' } ) ON COLUMNS '+
																			   'FROM [DATA_ANALYSIS])))) '+
											'WHERE ( [Dim_Календарь].[Месяц].CurrentMember, '+
													'[Dim_Предприятие].[Предприятие_Подразделение_Признак_Логистическое].&[Да], '+
													'[Dim_Документы].[Документы_Тип].CurrentMember, '+
													'[Dim_Документы].[Документы_Признак_Реализация_Поставщику_Возврат].&[Нет], '+
													'[Dim_Контрагенты].[Контрагенты_Признак_Обособленные].CurrentMember ) '') '

-- остатки на конец периода
set @qwr6= 'union '+

'select ' +
'''Основной'' as ТипСклада, ' + 
'cast([[Dim_Предприятие]].[Предприятие_Округ_Наименование]].[Предприятие_Округ_Наименование]].[MEMBER_CAPTION]]] as nvarchar(100)) as Округ, ' + 
'cast([[Dim_Предприятие]].[Предприятие_Подразделение_Тип]].[Предприятие_Подразделение_Тип]].[MEMBER_CAPTION]]] as nvarchar(20)) as ТипПодразделения, ' + 
'cast([[Dim_Предприятие]].[Предприятие_Подразделение_Наименование]].[Предприятие_Подразделение_Наименование]].[MEMBER_CAPTION]]] as nvarchar(100)) as ЛогПодразделение, ' + 
'CAST([[Dim_Номенклатура]].[Номенклатура_Артикул]].[Номенклатура_Артикул]].[MEMBER_CAPTION]]] as nvarchar(20)) as Артикул, ' + 
'0 as ОстатокНач_Количество, ' + 
'0 as ОстатокНач_СтоимостьСНДС, ' + 
'0 as Продажи3Мес_Количество, ' + 
'0 as Продажи3Мес_Себестоимость, ' + 
'0 as Продажи3Мес_Стоимость, ' + 
'0 as Отгрузки3Мес_Количество, ' + 
'0 as Отгрузки3Мес_Себестоимость, ' + 
'0 as Отгрузки3Мес_Стоимость, ' + 
'0 as Продажи1Мес_Количество, ' + 
'0 as Продажи1Мес_Себестоимость, ' + 
'0 as Продажи1Мес_Стоимость, ' + 
'0 as Отгрузки1Мес_Количество, ' + 
'0 as Отгрузки1Мес_Себестоимость, ' + 
'0 as Отгрузки1Мес_Стоимость, ' + 
'CONVERT(/*numeric(12,2)*/float, cast([[Measures]].[Остатки_Количество_Ежедневные]]] as nvarchar)) as ОстаткиКон_Количество, ' + 
'CONVERT(/*numeric(12,2)*/float, cast([[Measures]].[Остатки_Стоимость_Ежедневные_с_НДС]]] as nvarchar)) as ОстаткиКон_СтоимостьСНДС ' + 


'from openquery(SSAS_DATA_ANALYSIS, '' SELECT NON EMPTY { [Measures].[Остатки_Количество_Ежедневные], ' + 
'[Measures].[Остатки_Стоимость_Ежедневные_с_НДС] } ON COLUMNS ' + 
', NON EMPTY { (' + @dtWhL + ', ' + 
'[Dim_Предприятие].[Предприятие_Округ_Наименование].[Предприятие_Округ_Наименование].ALLMEMBERS * ' + 
'[Dim_Предприятие].[Предприятие_Подразделение_Тип].[Предприятие_Подразделение_Тип].ALLMEMBERS * ' + 
'[Dim_Предприятие].[Предприятие_Подразделение_Наименование].[Предприятие_Подразделение_Наименование].ALLMEMBERS * ' + 
'[Dim_Номенклатура].[Номенклатура_Артикул].[Номенклатура_Артикул].ALLMEMBERS * ' + 
'[Dim_Номенклатура].[Номенклатура_Наименование].[Номенклатура_Наименование].ALLMEMBERS ) } ' + 
'having ( [Measures].[Остатки_Количество_Ежедневные]>0 and [Measures].[Остатки_Стоимость_Ежедневные_с_НДС]>=0) ON ROWS ' + 
'FROM ( SELECT ( { [Dim_Предприятие].[Предприятие_Подразделение_Признак_Логистическое].&[Да] } ) ON COLUMNS ' + 
'FROM ( SELECT ( { { [Dim_Предприятие].[Предприятие_Склад_Тип].&[101. Рабочие остатки], [Dim_Предприятие].[Предприятие_Склад_Тип].&[106. Дисконт] } } ) ON COLUMNS ' + 
'FROM ( SELECT ( { ' + @dtWhL + ' } ) ON COLUMNS ' + 
'FROM [DATA_ANALYSIS]))) ' + 
'WHERE ( [Dim_Предприятие].[Предприятие_Склад_Тип].CurrentMember, [Dim_Предприятие].[Предприятие_Подразделение_Признак_Логистическое].&[Да] ) '') '  

set @qwr7= 'union ' + 

'select ' + 
'''Дополнительные'' as ТипСклада, ' + 
'cast([[Dim_Предприятие]].[Предприятие_Округ_Наименование]].[Предприятие_Округ_Наименование]].[MEMBER_CAPTION]]] as nvarchar(100)) as Округ, ' + 
'cast([[Dim_Предприятие]].[Предприятие_Подразделение_Тип]].[Предприятие_Подразделение_Тип]].[MEMBER_CAPTION]]] as nvarchar(20)) as ТипПодразделения, ' + 
'cast([[Dim_Предприятие]].[Предприятие_Подразделение_Наименование]].[Предприятие_Подразделение_Наименование]].[MEMBER_CAPTION]]] as nvarchar(100)) as ЛогПодразделение, ' + 
'CAST([[Dim_Номенклатура]].[Номенклатура_Артикул]].[Номенклатура_Артикул]].[MEMBER_CAPTION]]] as nvarchar(20)) as Артикул, ' + 
'0 as ОстатокНач_Количество, ' + 
'0 as ОстатокНач_СтоимостьСНДС, ' + 
'0 as Продажи3Мес_Количество, ' + 
'0 as Продажи3Мес_Себестоимость, ' + 
'0 as Продажи3Мес_Стоимость, ' + 
'0 as Отгрузки3Мес_Количество, ' + 
'0 as Отгрузки3Мес_Себестоимость, ' + 
'0 as Отгрузки3Мес_Стоимость, ' + 
'0 as Продажи1Мес_Количество, ' + 
'0 as Продажи1Мес_Себестоимость, ' + 
'0 as Продажи1Мес_Стоимость, ' + 
'0 as Отгрузки1Мес_Количество, ' + 
'0 as Отгрузки1Мес_Себестоимость, ' + 
'0 as Отгрузки1Мес_Стоимость, ' + 
'CONVERT(/*numeric(12,2)*/float, cast([[Measures]].[Остатки_Количество_Ежедневные]]] as nvarchar)) as ОстаткиКон_Количество, ' + 
'CONVERT(/*numeric(12,2)*/float, cast([[Measures]].[Остатки_Стоимость_Ежедневные_с_НДС]]] as nvarchar)) as ОстаткиКон_СтоимостьСНДС ' + 

'from openquery(SSAS_DATA_ANALYSIS, '' SELECT NON EMPTY { [Measures].[Остатки_Количество_Ежедневные], ' + 
'[Measures].[Остатки_Стоимость_Ежедневные_с_НДС] } ON COLUMNS ' + 
', NON EMPTY { (' + @dtWhL + ', ' + 
'[Dim_Предприятие].[Предприятие_Округ_Наименование].[Предприятие_Округ_Наименование].ALLMEMBERS * ' + 
'[Dim_Предприятие].[Предприятие_Подразделение_Тип].[Предприятие_Подразделение_Тип].ALLMEMBERS * ' + 
'[Dim_Предприятие].[Предприятие_Подразделение_Наименование].[Предприятие_Подразделение_Наименование].ALLMEMBERS * ' + 
'[Dim_Номенклатура].[Номенклатура_Артикул].[Номенклатура_Артикул].ALLMEMBERS * ' + 
'[Dim_Номенклатура].[Номенклатура_Наименование].[Номенклатура_Наименование].ALLMEMBERS ) } ' + 
'having ( [Measures].[Остатки_Количество_Ежедневные]>0 and [Measures].[Остатки_Стоимость_Ежедневные_с_НДС]>=0) ON ROWS ' + 
'FROM ( SELECT ( { [Dim_Предприятие].[Предприятие_Подразделение_Признак_Логистическое].&[Да] } ) ON COLUMNS ' + 
'FROM ( SELECT ( { { [Dim_Предприятие].[Предприятие_Склад_Тип].&[102. Витрина], [Dim_Предприятие].[Предприятие_Склад_Тип].&[103. Брак], [Dim_Предприятие].[Предприятие_Склад_Тип].&[104. Уценка], [Dim_Предприятие].[Предприятие_Склад_Тип].&[108. Доп. запас под ПРОЕКТЫ], [Dim_Предприятие].[Предприятие_Склад_Тип].&[109. Производство] } } ) ON COLUMNS ' + 
'FROM ( SELECT ( { ' + @dtWhL + ' } ) ON COLUMNS ' + 
'FROM [DATA_ANALYSIS]))) ' + 
'WHERE ( [Dim_Предприятие].[Предприятие_Склад_Тип].CurrentMember, [Dim_Предприятие].[Предприятие_Подразделение_Признак_Логистическое].&[Да] ) '') ' + 
') as всп_Табл ' + 
'group by ' + 
'ТипСклада, ' + 
'Округ, ' + 
'ТипПодразделения, ' + 
'ЛогПодразделение, ' + 
'Артикул '                                 

	
print(@qwr+@qwr1+@qwr2+@qwr3+@qwr4+@qwr5+@qwr6+@qwr7)
--exec(@qwr+@qwr1+@qwr2+@qwr3+@qwr4+@qwr5+@qwr6+@qwr7)

select (@qwr+@qwr1+@qwr2+@qwr3+@qwr4+@qwr5+@qwr6+@qwr7)										                                
select (@qwr)
select (@qwr1)
select (@qwr2)
select (@qwr3)
select (@qwr4)
select (@qwr5)
select (@qwr6)
select (@qwr7)
--alter database MINIMAKS_SQL set multi_user



declare @x varchar(max)
declare @y varchar(max)

select @x = replicate(cast('a' as varchar(max)),10000)
select @y = 'b'

set @y = replicate(@y,10000)

select len(@x), len(@y), len(@x + @y)


select * from  openquery ([10.11.0.27], 'select * from [##tmpeieaz1]')

exec [10.11.0.27].Smr_trade.dbo.sp_executesql @SQL=N'CREATE TABLE ##tmpeieaz1 (ID INT); select * from [##СборДанных_] '